bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G473xx.svd
            <register>
               <name>PCROP1ER</name>
               <displayName>PCROP1ER</displayName>
               <description>Flash Bank 1 PCROP End address           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>PCROP1_END</name>
                     <description>Bank 1 PCROP area end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>PCROP_RDP</name>
                     <description>PCROP area preserved when RDP level               decreased</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRP1AR</name>
               <displayName>WRP1AR</displayName>
               <description>Flash Bank 1 WRP area A address           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRP1A_STRT</name>
                     <description>Bank 1 WRP first area start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>WRP1A_END</name>
                     <description>Bank 1 WRP first area A end               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRP1BR</name>
               <displayName>WRP1BR</displayName>
               <description>Flash Bank 1 WRP area B address           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRP1B_STRT</name>
                     <description>Bank 1 WRP second area B end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>WRP1B_END</name>
                     <description>Bank 1 WRP second area B start               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC1R</name>
               <displayName>SEC1R</displayName>
               <description>securable area bank1 register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFF00FF00</resetValue>
               <fields>
                  <field>
                     <name>BOOT_LOCK</name>
                     <description>BOOT_LOCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEC_SIZE1</name>
                     <description>SEC_SIZE1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DBGMCU</name>
         <description>Debug support</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0xE0042000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDCODE</name>
               <displayName>IDCODE</displayName>
               <description>MCU Device ID Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identifier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Debug MCU Configuration           Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_SLEEP</name>
                     <description>Debug Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STOP</name>
                     <description>Debug Stop Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STANDBY</name>
                     <description>Debug Standby Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRACE_IOEN</name>
                     <description>Trace pin assignment               control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRACE_MODE</name>
                     <description>Trace pin assignment               control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1L_FZ</name>
               <displayName>APB1L_FZ</displayName>
               <description>APB Low Freeze Register 1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIMER2_STOP</name>
                     <description>Debug Timer 2 stopped when Core is               halted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM3_STOP</name>
                     <description>TIM3 counter stopped when core is               halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM4_STOP</name>
                     <description>TIM4 counter stopped when core is               halted</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM5_STOP</name>
                     <description>TIM5 counter stopped when core is               halted</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER6_STOP</name>
                     <description>Debug Timer 6 stopped when Core is               halted</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM7_STOP</name>
                     <description>TIM7 counter stopped when core is               halted</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>Debug RTC stopped when Core is               halted</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG_STOP</name>
                     <description>Debug Window Wachdog stopped when Core               is halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>Debug Independent Wachdog stopped when               Core is halted</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C1_STOP</name>
                     <description>I2C1 SMBUS timeout mode stopped when               core is halted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C2_STOP</name>
                     <description>I2C2 SMBUS timeout mode stopped when               core is halted</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C3_STOP</name>
                     <description>I2C3 SMBUS timeout mode stopped when               core is halted</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIMER_STOP</name>
                     <description>LPTIM1 counter stopped when core is               halted</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1H_FZ</name>
               <displayName>APB1H_FZ</displayName>
               <description>APB Low Freeze Register 2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_I2C4_STOP</name>
                     <description>DBG_I2C4_STOP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2_FZ</name>
               <displayName>APB2_FZ</displayName>
               <description>APB High Freeze Register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1_STOP</name>
                     <description>TIM1 counter stopped when core is               halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM8_STOP</name>
                     <description>TIM8 counter stopped when core is               halted</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM15_STOP</name>
                     <description>TIM15 counter stopped when core is               halted</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM16_STOP</name>
                     <description>TIM16 counter stopped when core is               halted</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM17_STOP</name>
                     <description>TIM17 counter stopped when core is               halted</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM20_STOP</name>
                     <description>TIM20counter stopped when core is               halted</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_HRTIM0_STOP</name>
                     <description>DBG_HRTIM0_STOP</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_HRTIM1_STOP</name>
                     <description>DBG_HRTIM0_STOP</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_HRTIM2_STOP</name>
                     <description>DBG_HRTIM0_STOP</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_HRTIM3_STOP</name>
                     <description>DBG_HRTIM0_STOP</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
