bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G473xx.svd
            <register>
               <name>C15CR</name>
               <displayName>C15CR</displayName>
               <description>DMAMux - DMA request line multiplexer           channel x control register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>Input DMA request line               selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Interrupt enable at synchronization               event overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation               enable/disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronous operating mode               enable/disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization event type selector               Defines the synchronization event on the selected               synchronization input:</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests to forward               Defines the number of DMA requests forwarded before               output event is generated. In synchronous mode, it               also defines the number of DMA requests to forward               after a synchronization event, then stop forwarding.               The actual number of DMA requests forwarded is               NBREQ+1. Note: This field can only be written when               both SE and EGE bits are reset.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization input               selected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG0CR</name>
               <displayName>RG0CR</displayName>
               <description>DMAMux - DMA request generator channel x           control register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIG_ID</name>
                     <description>DMA request trigger input               selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Interrupt enable at trigger event               overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel               enable/disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger event type               selection Defines the trigger event on the selected               DMA request trigger input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to generate               Defines the number of DMA requests generated after a               trigger event, then stop generating. The actual               number of generated DMA requests is GNBREQ+1. Note:               This field can only be written when GE bit is               reset.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG1CR</name>
               <displayName>RG1CR</displayName>
               <description>DMAMux - DMA request generator channel x           control register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIG_ID</name>
                     <description>DMA request trigger input               selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Interrupt enable at trigger event               overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel               enable/disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger event type               selection Defines the trigger event on the selected               DMA request trigger input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to generate               Defines the number of DMA requests generated after a               trigger event, then stop generating. The actual               number of generated DMA requests is GNBREQ+1. Note:               This field can only be written when GE bit is               reset.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG2CR</name>
               <displayName>RG2CR</displayName>
               <description>DMAMux - DMA request generator channel x           control register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIG_ID</name>
                     <description>DMA request trigger input               selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Interrupt enable at trigger event               overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel               enable/disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger event type               selection Defines the trigger event on the selected               DMA request trigger input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to generate               Defines the number of DMA requests generated after a               trigger event, then stop generating. The actual               number of generated DMA requests is GNBREQ+1. Note:               This field can only be written when GE bit is               reset.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG3CR</name>
               <displayName>RG3CR</displayName>
               <description>DMAMux - DMA request generator channel x           control register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIG_ID</name>
                     <description>DMA request trigger input               selected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Interrupt enable at trigger event               overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel               enable/disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger event type               selection Defines the trigger event on the selected               DMA request trigger input</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to generate               Defines the number of DMA requests generated after a               trigger event, then stop generating. The actual               number of generated DMA requests is GNBREQ+1. Note:               This field can only be written when GE bit is               reset.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RGSR</name>
               <displayName>RGSR</displayName>
               <description>DMAMux - DMA request generator status           register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OF</name>
                     <description>Trigger event overrun flag The flag is               set when a trigger event occurs on DMA request               generator channel x, while the DMA request generator               counter value is lower than GNBREQ. The flag is               cleared by writing 1 to the corresponding COFx bit in               DMAMUX_RGCFR register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RGCFR</name>
               <displayName>RGCFR</displayName>
               <description>DMAMux - DMA request generator clear flag           register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COF</name>
                     <description>Clear trigger event overrun flag Upon               setting, this bit clears the corresponding overrun               flag OFx in the DMAMUX_RGCSR register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>DMAMUX request line multiplexer interrupt           channel status register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOF</name>
                     <description>Synchronization overrun event               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFR</name>
               <displayName>CFR</displayName>
               <description>DMAMUX request line multiplexer interrupt           clear flag register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSOF</name>
                     <description>Clear synchronization overrun event               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
